Tekla Open API Reference for Tekla Structures 2025
StraightDimension.UpDirection Property
 Gets or sets the direction from the dimension points to the dimension line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector UpDirection { get; set; }
Public Property UpDirection As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace